Hey @perezmark 👋 Thank you for taking the time to raise this! I noticed that you're using a module to create these resources. Is it possible that the module has the inputs swapped? I ask, as I attempted to reproduce this, and the plan looked right (I don't currently have an EKS cluster configuration handy, so I didn't go through an apply):

```terraform

variable "eks_name" { 
  default = "jretzolk-test-eks-cluster"
}

resource "aws_eks_addon" "csi_driver" {
  cluster_name             = var.eks_name
  addon_name               = "aws-ebs-csi-driver"
  addon_version            = "v1.11.4-eksbuild.1"
}
```

Output:

```shell
$ terraform plan
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.csi_driver will be created
  + resource "aws_eks_addon" "csi_driver" {
      + addon_name           = "aws-ebs-csi-driver"
      + addon_version        = "v1.11.4-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "jretzolk-test-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```